-- ============================================================
-- Домашнее задание к лекции «SQL. Введение»
-- Школа Аналитиков · учебная база hh_school
-- Автор: Морозов Артем Кириллович
-- ============================================================

SET search_path TO hh_school;

-- ============================================================
-- БЛОК А. Разминка: термины и структура (текстом)
-- ============================================================

-- ЗАДАНИЕ А1
-- 1. Категория и конкретный тип колонок:
--    vacancies.salary_from        — категория: числовой   тип: INTEGER
--    vacancies.vacancy_name       — категория: строковый   тип: TEXT
--    vacancies.published_at       — категория: дата и время   тип: TIMESTAMP
--    employers.is_accredited_it   — категория: логический   тип: BOOLEAN
--    responses.created_at         — категория: дата и время   тип: TIMESTAMP
--
-- 2. Первичные ключи таблиц:
--    areas: area_id
--    employers: employer_id
--    vacancies: vacancy_id
--    vacancy_details: vacancy_id (чем особенный: особен тем, что первичный ключ этой таблицы является 
--    внешним ключем, ссылающимся на первичный ключ vacancy_id в таблице vacancies)
--    responses: response_id
--
-- 3. Почему vacancy_name не может быть первичным ключом:
--    Потому что vacancy_name не является уникальным значением, а названия вакансий могут повторяться
--    Запрос для подтверждения числом:

SELECT  
	vacancy_name,
	COUNT(*) AS vacancy_count
FROM vacancies
GROUP BY vacancy_name 
ORDER BY vacancy_count DESC
LIMIT 1;

-- Вывод:
--Стажёр: аналитик данных	6
-- то есть мы видим то что в таблице существует 6 вакансий с названием "Стажёр: аналитик данных" - эта вакансия самая часто встречающаяся
-- в таблице vacancies. И значит vacancy_name не подходит как первичный ключ, потому что не отвечает требованию в уникальности.
-- Еще первичный ключ должен позволять однозначно определять конкретную запись в таблице, а vacancy_name не может это сделать
-- опять же, потому что есть повторения.


-- 4. Что произойдёт при записи строки «по договорённости» в salary_from:
--  При попытке вписать строку "по договорённости" вывелась ошибка:
-- SQL Error [22P02]: ОШИБКА: неверный синтаксис для типа integer: "по договорённости"
-- Произошло это потому что salary_from имеет числовой тип INTEGER, а "по договорённости" - строка (TEXT). 
-- Это хорошо, потому что типизация обеспечивает корректность данных помогает избежать ошибок и дает возможность 
-- безопасно проводить все операции, которые нужно делать со значениями таблицы 
-- (считать среднее или медиану в зарплатах и тому подобное)

-- ============================================================
-- БЛОК Б. Первые запросы: SELECT, WHERE, ORDER BY
-- ============================================================

-- ЗАДАНИЕ Б1
-- Запрос: experience
SELECT DISTINCT experience
FROM vacancies
ORDER BY 1;

-- Запрос: employment
SELECT DISTINCT employment
FROM vacancies
ORDER BY 1;

-- Запрос: professional_role
SELECT DISTINCT professional_role
FROM vacancies
ORDER BY 1;

-- Вывод:
-- В колонке experience 3 различных значения, в employment тоже 3, в professional_role 5.
-- Проблем с качеством данных нет. Нет неожиданных значений, null нет и значения соответствуют названию колонок.


-- ЗАДАНИЕ Б2
-- Запрос 1: стажировки в Москве без опыта, вакансия открыта 
SELECT 
	vacancy_id,
	vacancy_name,
	salary_from,
	published_at
FROM vacancies 
WHERE area_id = 1 AND experience = 'Нет опыта' AND closed_at IS NULL AND employment = 'Стажировка'
ORDER BY published_at DESC;

-- Запрос 2: топ-10 вакансий по salary_from
SELECT
	vacancy_name,
	professional_role,
	salary_from
FROM vacancies
WHERE salary_from IS NOT NULL
ORDER BY salary_from DESC
LIMIT 10;

-- Вывод:
-- Первый запрос нашел 8 вакансий, если уберем условие про Москву (удалим из запроса "area_id = 1 AND"),
-- то будет 10 значений


-- ЗАДАНИЕ Б3
-- Ловушка 1. NULL — выполнить и объяснить результат
SELECT count(*) FROM vacancies WHERE closed_at = NULL;
SELECT count(*) FROM vacancies WHERE closed_at IS NULL;

-- Ловушка 2. AND / OR — выполнить и объяснить результат
SELECT count(*) FROM vacancies
WHERE area_id = 1 OR area_id = 2 AND experience = 'Нет опыта';

SELECT count(*) FROM vacancies
WHERE (area_id = 1 OR area_id = 2) AND experience = 'Нет опыта';

-- Вывод:
-- Ловушка 1: первый запрос дал 0, а второй дал 33. NULL в closed_at означает, что вакансия еще открыта.
-- NULL - это отсутствие значения и closed_at = NULL нельзя писать, потому что сравнение
-- = NULL возвращает unknown, а не true или false, и такие строки не проходят фильтрацию where.
-- Это опаснее ошибки, потому что запрос выполняется и возвращается значение 0, которое можно
-- ошибочно принять за правильный результат.

-- Ловушка 2: AND выполняется раньше OR, поэтому в первом запросе сначала находят вакансии, которые находятся в 
-- Питере и не имеют опыта, а потом к ним добавляются все вакансии из Москвы с помощью OR.
-- Второй запрос уже отвечает на нужный вопрос, потому что сначала выполняется условие в скобках 
-- (Москва или Санкт-Петербург) и потом из них с помощью AND остаются только вакансии без опыта.

-- ============================================================
-- БЛОК В. Агрегации и метрики
-- ============================================================

-- ЗАДАНИЕ В1
-- Запрос 1: счётчики (строки, зарплата указана, направления, работодатели)
SELECT 
	COUNT(*) AS vacancy_count,
	COUNT(salary_from) AS vacancy_with_salary_from,
	COUNT(DISTINCT professional_role) AS professional_roles_count,
	COUNT(DISTINCT employer_id) AS employers_count
FROM vacancies;

-- Запрос 2: доля активных вакансий (без JOIN)
SELECT 
	(COUNT(*) - COUNT(closed_at)) AS open_vacancies,
	COUNT(closed_at) AS closed_vacancies,
	ROUND((COUNT(*) - COUNT(closed_at)) * 100.0 / COUNT(*), 1) AS open_vacancies_share
FROM vacancies;

-- Вывод:
-- 1) COUNT(*) считает все строки, даже с NULL (при выполнении запроса vacancy_count = 52),
-- COUNT(salary_from) считает строки с непустым значением нижней границы зп (null не считает, vacancy_with_salary_from = 44),
-- COUNT(DISTINCT professional_role) считает число различных направлений без повторения (professional_roles_count = 5, т.е 5 различных направлений),
-- COUNT(DISTINCT employer_id) вернул 12 работодателей.
-- 2) Сейчас открыто 33 вакансии из 52, соответственно 19 закрыто. Доля активных вакансий 63,5%.


-- ЗАДАНИЕ В2
-- Запрос 1: направления — вакансии, работодатели, средняя зарплата
SELECT
	professional_role,
	COUNT(*) AS vacancy_count,
	COUNT(DISTINCT employer_id) AS employers_count,
	ROUND(AVG(salary_from), 0) AS average_salary_from
FROM vacancies 
GROUP BY professional_role
ORDER BY vacancy_count DESC;

-- Запрос 2: то же, только направления с ≥ 5 открытыми вакансиями (WHERE + HAVING)
SELECT
	professional_role,
	COUNT(*) AS vacancy_count,
	COUNT(DISTINCT employer_id) AS employers_count,
	ROUND(AVG(salary_from), 0) AS average_salary_from
FROM vacancies 
WHERE closed_at IS NULL
GROUP BY professional_role
HAVING COUNT(*) >= 5
ORDER BY vacancy_count DESC;

-- Вывод:
-- 1) Больше половины рынка занимают аналитики данных (16 вакансий) и разработчики (15 вакансий),
-- соискатель мог бы сделать вывод о большом количестве доступных вакансий в этих направлениях. 
-- Но этот запрос не учитывает статус вакансии (закрыта или открыта). После фильтрации WHERE closed_at IS NULL во втором запросе
-- остаются только открытые вакансии и например количество вакансий разработчика снижается почти вдвое (с 15 до 8).
-- 2) Where фильтрует строки до группировки, а having делает это уже после группировки.
-- Если напишем where count(*) >= 5, то выдаст ошибку потому что группы еще не построены
-- 3) avg(salary_from) показывает среднюю нижнюю границу зарплаты среди вакансий по направлениям, где указана 
-- salary_from (не учитываются значения null). Следовательно это среднее отражает только 
-- вакансии с указанной зарплатой и не дает возможность сделать вывод о среднем уровне 
-- зарплат по всем вакансиям направления.

-- ПРАВКА: 
-- Ответ на вопрос "почему одинаковый разрез дает разное количество вакансий?":
-- Разница возникает из-за фильтрации с where, а не из-за group by.
-- В первом запросе учитывались все вакансии, а во втором WHERE closed_at IS NULL
-- исключал закрытые вакансии до группировки.

-- Новый запрос: объединил total_vacancies (общее количество вакансий) и open_vacancies (количество открытых вакансий)
-- в одну таблицу, чтобы сравнить их в одном разрезе:
WITH total_vacancies_stats AS (
	SELECT
		professional_role,
		COUNT(*) AS total_vacancies
	FROM vacancies
	GROUP BY professional_role
),
open_vacancies_stats AS (
	SELECT 
		professional_role,
		COUNT(*) AS open_vacancies,
		ROUND(AVG(salary_from), 0) AS average_salary_from
	FROM vacancies
	WHERE closed_at IS NULL
	GROUP BY professional_role
)
SELECT
	t.professional_role,
	t.total_vacancies,
	COALESCE(o.open_vacancies, 0) AS open_vacancies,
	o.average_salary_from
FROM total_vacancies_stats AS t
LEFT JOIN open_vacancies_stats	AS o 
	ON t.professional_role = o.professional_role
ORDER BY t.total_vacancies DESC;
-- Вывод:
-- 1) Для оценки возможностей трудоустройства используем open_vacancies,
-- так как эта метрика показывает количество актуальных предложений.
-- total_vacancies полезна для оценки общего объема вакансий.
-- Для написания запроса использовал знания из 2 лекции, решил через CTE сделать, чтобы попрактиковаться).
-- 2) В первом cte (total_vacancies_stats) считаю общее количество вакансий, 
-- а во втором (open_vacancies_stats) открытые вакансии 
-- и среднюю зарплату (считаю среднюю зарплату по активным, так как
-- данные по ним важнее при аналитике зарплат для соискателя).
-- В конце объединяю результаты с помощью left join.
-- Благодаря использованию cte получилось разделить расчеты и избежать того,
-- чтобы where фильтровал всю таблицу и общее кол-во вакансий считалось неправильно.


-- ============================================================
-- БЛОК Г. Соединение таблиц
-- ============================================================

-- ЗАДАНИЕ Г1
-- Запрос: топ-5 по salary_from с названием компании и городом (псевдонимы таблиц)
SELECT
	v.vacancy_name,
	e.employer_name,
	a.area_name,
	v.salary_from
FROM vacancies v
JOIN employers e ON v.employer_id = e.employer_id
JOIN areas a ON v.area_id = a.area_id 
WHERE salary_from IS NOT NULL
ORDER BY salary_from DESC
LIMIT 5;

-- Вывод:
-- Если убрать псевдонимы и написать просто area_id, то выводится ошибка:
-- SQL Error [42702]: ОШИБКА: неоднозначная ссылка на столбец "area_id" Позиция: 81
-- Потому что area_id находится сразу в нескольких таблицах и программа не понимает откуда 
-- брать значение.


-- ЗАДАНИЕ Г2
-- Запрос 1: все работодатели, число вакансий и откликов (LEFT JOIN)
SELECT 
	e.employer_name,
	COUNT(DISTINCT v.vacancy_id) AS vacancy_count, 
	COUNT(r.response_id) AS response_count
FROM employers e
LEFT JOIN vacancies v ON e.employer_id = v.employer_id
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id
GROUP BY e.employer_id
ORDER BY response_count DESC;


-- Запрос 2: тот же запрос с INNER JOIN
SELECT 
	e.employer_name,
	COUNT(DISTINCT v.vacancy_id) AS vacancy_count, 
	COUNT(r.response_id) AS response_count
FROM employers e
INNER JOIN vacancies v ON e.employer_id = v.employer_id
INNER JOIN responses r ON v.vacancy_id = r.vacancy_id
GROUP BY e.employer_id
ORDER BY response_count DESC;

-- Вывод:
-- 1) distinct нужен, потому что он помогает избежать дублирования вакансий с несколькими откликами,
-- он учитывает каждую вакансию только один раз.
-- COUNT(*) посчитает все строки после соединения и завысит количество вакансий,
-- 2) при запросе с inner исчезла компания ГринЭнерго у которой при наличии одной вакансии 0 откликов.
-- Это содержательная потеря, так как исключение такой компании скрывает саму проблему отсутствия откликов
-- и не отражает реальное положение дел среди работодателей. Было 12 работодателей, а стало 11.
-- 3) inner join используем, когда нужно нужны записи с совпадениям в обеих таблицах (когда нужно исключить данные 
-- для которых нет совпадений в присоединяемой таблице)
-- А left join, когда нужны все данные из основной таблицы, аже если в присоединяемой таблице для них нет соответствующих данных.

-- ============================================================
-- БЛОК Д. Функции и финальный кейс
-- ============================================================

-- ЗАДАНИЕ Д1
-- Запрос: помесячная динамика откликов и конверсия
-- (месяц как дата, условный агрегат, nullif в знаменателе)
SELECT 
	date_trunc('month', r.created_at)::date AS month,
	COUNT(r.response_id) AS responses,
	COUNT(r.response_id) FILTER (WHERE r.status = 'invited') AS invited,
	ROUND(
		COUNT(r.response_id) FILTER (WHERE r.status = 'invited')
		* 100.0 / nullif(COUNT(r.response_id), 0), 1) AS conversion_pct
FROM responses r
GROUP BY date_trunc('month', r.created_at)::date 
ORDER BY month;
	

-- Вывод:
-- 1) Максимальная конверсия была в июне и составляла 19,5% (23 приглашения из 118 откликов)
-- 2) В июне было 118 откликов, это один из самых больших по объему наблюдений среди других месяцев,
-- поэтому ему можно доверять (конверсия выглядит более устойчивой, чем в месяцах с меньшим количеством
-- откликов). Но 118 откликов все еще мало, чтобы с полной уверенностью говорить о сезонности или делать прогнозы. 
-- 3) В последнем месяце (августе) наблюдается сильное падение конверсии (она минимальная за год и равна 7,3%).
-- Но мы также видим, что в августе было сильное падение откликов после прошлых месяцев (всего 41 отклик), 
-- поэтому сравнивать его с другими месяцами некорректно. Нужно понять учитывался весь месяц или только его
-- часть (можно предположить, что на момент записи данных август еще не закончился), для планирования набора
-- нужно понимать полноту данных.

-- ПРАВКА:
-- Проверка дат откликов в августе. Я делал предположение, что август учитывался неполностью,
-- поэтому запросом ниже проверю предположение:
SELECT created_at, status
FROM responses 
WHERE created_at >= '2026-08-01' AND created_at < '2026-09-01'
ORDER BY created_at DESC;
-- По результатам запроса вижу, что последний отклик был 15 августа, а до этой даты
-- отклики стабильно появлялись по 1-4 в день. Всего за август был 41 отклик.
-- учитывая стабильность появления новых отзывов до 15 августа, можно 
-- подтвердить мою догадку о том, что август в нашей выборке предоставлен неполностью,
-- значит сравнивать его с другими месяцами некорректно.

-- p.s. Решил добавить запрос на проверку максимальной даты среди всех откликов в таблице,
-- чтобы доказать, что в середине августа запись данных закончилась:
SELECT MAX(created_at)
FROM responses;
-- Результат запроса: 2026-08-15 08:00:00.000 совпадает с первой строкой в резульатте 
-- прошлого запроса, значит действительно в таблице нет откликов после 15 августа.

-- ЗАДАНИЕ Д2
-- Запрос: таблица по направлениям (вакансии, отклики, приглашения,
-- откликов на вакансию, конверсия)
SELECT
	v.professional_role,
	COUNT(DISTINCT v.vacancy_id) AS vacancies_count,
	COUNT(r.response_id) AS responses,
	COUNT(r.response_id) FILTER (WHERE r.status = 'invited') AS invited,
	ROUND(
		COUNT(r.response_id) * 1.0 / NULLIF(COUNT(DISTINCT v.vacancy_id), 0), 1
		) AS responses_per_vacancy,
	ROUND(
		COUNT(r.response_id) FILTER (WHERE r.status = 'invited')
		* 100.0 / nullif(COUNT(r.response_id), 0), 1
		) AS conversion_pct
FROM vacancies v
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id 
GROUP BY v.professional_role
ORDER BY vacancies_count DESC;

-- Письменные ответы:
-- 1. Совпадает ли направление с наибольшим числом вакансий с направлением
--    с наибольшей конверсией?
-- Нет, не совпадает. Наибольшее число вакансий аналитика данных - 16, конверсия равна 12,1%,
-- а на тестировщика приходится наибольшая конверсия равная 35,9%, хотя вакансий всего 7.
-- 2. Какое направление выбрать и почему (опираясь на два столбца):
-- Я бы выбрал направление разработчика, так как оно показывает высокую конверсию 17,3%, а среднее
-- количество откликов на вакансию 9,3. Если сравнивать с аналитикой данных, где конверсия ниже (12,1%) и
-- доля откликов на вакансию 19,6 (что может указывать на более высокую конкуренцию среди соискателей).
-- Тестировщик, который имеет очень высокую конверсию равную 35,9%, но она рассчитана всего на 39
-- откликах, а разработка рассчитана на 139, поэтому оценку конверсии на разработчика можно считать
-- более достоверной и устойчивой.
-- 3. Оговорка к выводу:
-- Данные в таблице не учитывают соответствие навыков определенного кандидата к вакансии,
-- также неизвестны сроки наблюдения за каждой вакансией (сколько времени была открыта и т.п.).
-- Также в запросе нет условия о том, что вакансии должны быть открытыми (нет условия where closed_at is null)
-- поэтому количество вакансий в таблице не показывает актуальность предложений.
-- Сравнение направлений на основании эти метрик может неверно отражать реальную ситуацию на рынке.


-- ============================================================
-- БЛОК Е. Со звёздочкой
-- ============================================================

-- ЗАДАНИЕ Е1
-- Исходный запрос (выполнить и посмотреть результат):
SELECT v.professional_role,
	count(*) AS vacancies, -- ошибка 3
	sum(v.salary_from) AS total_salary, -- ошибка 4
	count(r.response_id) / count(*) AS responses_per_vacancy -- ошибка 2
FROM vacancies v
JOIN responses r ON v.vacancy_id = r.vacancy_id
WHERE v.closed_at = NULL -- ошибка 1
GROUP BY 1;


-- Ошибки (минимум четыре):
-- 1. Главная ошибка в строке WHERE v.closed_at = NULL. Из-за нее вся таблица становится пустой, нельзя писать
-- = NULL (так возвращается значение unknown и запрос с = искючает все записи и таблица пустая), нужно IS NULL.
-- 2. Далее в строке count(r.response_id) / count(*) AS responses_per_vacancy сразу 2 ошибки.
-- Во-первых, count(*) в знаменателе считает строки после join, из-за этого будет неправильный подсчет, 
-- нужно использовать COUNT(DISTINCT v.vacancy_id), чтобы считать уникальные вакансии.
-- Во-вторых, при делении count(r.response_id) / count(*) происходит целочисленное деление, поэтому дробная часть
-- результатов теряется. Чтобы она не терялось нужно числитель домножить на 1.0 и использовать ROUND для округления.
-- 3. В строке count(*) AS vacancies нужно использовать DISTINCT, так как у вакансии может быть много откликов
-- и т.к. count(*) считает строки после join, поэтому вместо подсчета уникальных вакансий мы получим
-- количество откликов.
-- 4. В строке sum(v.salary_from) AS total_salary неправильно считается общая зп, потому что
-- после join одна вакансия считается несколько раз (столько раз, сколько откликов) и в итоге, зарплата
-- одной вакансии считается несколько раз и получаются оченб большие суммы. 
-- 5. Последняя ошибка, которую я нашел, в строке с join. Обычный join равен inner join, а значит не добавляет в таблицу
-- вакансии у которых нет откликов, нужно использовать left join.
-- 6. Еще не совсем ошибка, но в строке GROUP BY нам на лекции говорили, что GROUP BY 1 группирует по первой колонке - это норм,
-- но лучше писать явно по какой колонке группируем, чтобы запрос проще читался.
-- 7. Еще как замечание: в знаменателе count(r.response_id) / count(*) нет nullif, который защищает от ошибки деления на ноль.
-- Хотя в этом запросе count(*) не может быть равен 0, все равно лучше использовать nullif.

-- Исправленный запрос:
SELECT 
	v.professional_role,
	count(DISTINCT v.vacancy_id) AS vacancies,
	ROUND(count(r.response_id) * 1.0 / NULLIF(count(DISTINCT v.vacancy_id), 0), 1) AS responses_per_vacancy
FROM vacancies v
LEFT JOIN responses r ON v.vacancy_id = r.vacancy_id
WHERE v.closed_at IS NULL
GROUP BY v.professional_role;

-- Запрос подсчета зарплатной метрики: средней минимальной зарплаты по профессии.
SELECT
	professional_role,
	ROUND(avg(salary_from),1) AS average_salary_from
FROM vacancies
WHERE closed_at IS NULL
GROUP BY professional_role;
-- Я решил заменить sum на avg, потому что сумма минимальных зарплат вакансий не дает 
-- полезной информации соискателю. 
-- avg(salary_from) более полезна для анализа рынка вакансий, так как показывает среднюю
-- нижнюю границу зарплат по каждому направлению. Соискатель может сравнивать предложения
-- по зп между профессиями и видеть, где предлагают больше.
-- Посчитал эту метрику отдельным запросом, потому что если добавить avg(salary_from) в основной
-- запрос с join, среднее будет считать неправильно (вакансии с большим количеством откликов 
-- влияли бы на итоговое значение). При этом avg не учитывает null, поэтому результат отражает
-- вакансии у которых salary_from указана.

-- Какие два правила из лекции защитили бы от этих ошибок при написании запроса:
-- 1. Правило работы с NULL, нужно использовать is чтобы в результате не получить пустую таблицу или ошибку
-- 2. Когда работаем с join нужно понимать какие таблицы соединяем, какие в них данные (полные или нет),
-- чтобы потом не потерять важные данные. Также когда пишем агрегатные функции нужно знать что join
-- может размножать строки и в итоге мы получим неправильный результат вычислений
